Revit 2027 API
MEPCurve.Height Property
The height of the MEP curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
public:
property double Height {
	double get ();
}
member Height : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the MEP curve's Shape is not rectangular.
Remarks
This property is used to retrieve the height of the MEP curve.
See Also
Reference
MEPCurve Class
Autodesk.Revit.DB Namespace